vuln-app/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (name LIKE '%%' OR body LIKE '%%')  ORDER BY ..\..\..\..\..\..\..\..\..\..\..\..\..\..\..\..\windows\win.ini created_at
---
  def index
    query = %w(% %).join params[:q].to_s.gsub('%', '\\%').gsub('_', '\\_')
    @posts = Post.where("name LIKE ? OR body LIKE ?", query, query).order(params[:order])

INSERT INTO "posts" ("name", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test post"], ["body", "test post body"], ["created_at", "2015-10-23 22:23:45.139572"], ["updated_at", "2015-10-23 22:23:45.139572"]]
---
  def create
    @post = Post.create post_params

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 309456473]]
---
  def set_post
    @post = Post.find_by_id params[:id]